/**
******************************************************************************
* @file    基于elmo驱动器的电机初始化
* @author  tzaiyang
* @version
* @date
* @brief
******************************************************************************
* @attention
*
*
*
*
******************************************************************************
*/
/* Includes -------------------------------------------------------------------*/

#include "Walk.h"


/* Private  typedef -----------------------------------------------------------*/
/* Private  define ------------------------------------------------------------*/
/* Private  macro -------------------------------------------------------------*/
/* Private  variables ---------------------------------------------------------*/

/* Extern   variables ---------------------------------------------------------*/
/* Extern   function prototypes -----------------------------------------------*/
/* Private  function prototypes -----------------------------------------------*/
/* Private  functions ---------------------------------------------------------*/
/* Exported function prototypes -----------------------------------------------*/
/* Exported functions ---------------------------------------------------------*/

/**
* @brief   电机初始化与使能
* @param   acc：加速度 dcc：减速度
* @param   n：用于走形的电机数
* @retval  0
*/
uint8_t ElmoInit(uint32_t acc,uint32_t dcc,uint8_t n)
{
	  elmo_Init();
	  for(int i=0;i<=n;i++)elmo_Enable(i);
	/*********************MOTOR DRIVE INTI**************************/
	  for(int i=0;i<=n;i++)Vel_cfg(i,acc,dcc);  //configuring Acceleration and Deceleration
	
	  return 0;
}




/************************ (C) COPYRIGHT 2016 ACTION *****END OF FILE****/


